// data by year

var entry_data = [
    {"year": "100年","總計": "49636631","紅線小計": "37374614","R3小港站": "2069422","R4高雄國際機場站": "651307","R4A草衙站": "830740","R5前鎮高中站": "1289621","R6凱旋站": "1376002","R7獅甲站": "882967","R8三多商圈站": "3659269","R9中央公園站": "3192761","R11高雄車站": "5116253","R1+M:AJ2後驛站": "1562240","R13凹子底站": "1344501","R14巨蛋站": "3954792","R15生態園區站": "1052410","R16左營站": "4452999","R17世運站": "520714","R18油廠國小站": "782443","R19楠梓加工區站": "1065848","R20後勁站": "428544","R21都會公園站": "922114","R22青埔站": "293455","R22A橋頭糖廠站": "317555","R23橋頭火車站": "1337011","R24南岡山站": "0","紅線團體票": "166256","紅線其他": "105390","橘線小計": "12262017","O1西子灣站": "1165949","O2鹽埕埔站": "1014077","O4市議會站": "856027","O5R10美麗島站": "2215639","O6信義國小站": "598804","O7文化中心站": "1121700","O8五塊厝站": "558160","O9技擊館站": "648360","O10衛武營站": "579155","O11鳳山西站": "913725","O12鳳山站": "628728","O13大東站": "445522","O14鳳山國中站": "514368","OT1大寮站": "899567","橘線團體票": "65165","橘線其他": "37071"}
,   {"year": "101年","總計": "56480381","紅線小計": "42371470","R3小港站": "2385090","R4高雄國際機場站": "720199","R4A草衙站": "953483","R5前鎮高中站": "1450963","R6凱旋站": "1527526","R7獅甲站": "976769","R8三多商圈站": "3991327","R9中央公園站": "3544272","R11高雄車站": "5470763","R1+M:AJ2後驛站": "1817210","R13凹子底站": "1561412","R14巨蛋站": "4499641","R15生態園區站": "1221709","R16左營站": "5161522","R17世運站": "611256","R18油廠國小站": "885740","R19楠梓加工區站": "1277396","R20後勁站": "500369","R21都會公園站": "1054213","R22青埔站": "343854","R22A橋頭糖廠站": "379495","R23橋頭火車站": "1673026","R24南岡山站": "49308","紅線團體票": "150324","紅線其他": "164603","橘線小計": "14108911","O1西子灣站": "1363805","O2鹽埕埔站": "1174555","O4市議會站": "952310","O5R10美麗島站": "2533651","O6信義國小站": "685500","O7文化中心站": "1234844","O8五塊厝站": "644064","O9技擊館站": "708369","O10衛武營站": "668475","O11鳳山西站": "1027605","O12鳳山站": "684459","O13大東站": "641638","O14鳳山國中站": "599663","OT1大寮站": "1040324","橘線團體票": "101231","橘線其他": "48418"}
,   {"year": "102年","總計": "60706303","紅線小計": "45744746","R3小港站": "2568773","R4高雄國際機場站": "755398","R4A草衙站": "1059497","R5前鎮高中站": "1526695","R6凱旋站": "1803246","R7獅甲站": "1020334","R8三多商圈站": "4160172","R9中央公園站": "3727534","R11高雄車站": "5545795","R1+M:AJ2後驛站": "1941231","R13凹子底站": "1689699","R14巨蛋站": "4719879","R15生態園區站": "1316411","R16左營站": "5693890","R17世運站": "575354","R18油廠國小站": "973158","R19楠梓加工區站": "1395600","R20後勁站": "530105","R21都會公園站": "1130994","R22青埔站": "320231","R22A橋頭糖廠站": "407217","R23橋頭火車站": "1074601","R24南岡山站": "1527371","紅線團體票": "160092","紅線其他": "121469","橘線小計": "14961557","O1西子灣站": "1542071","O2鹽埕埔站": "1307281","O4市議會站": "976639","O5R10美麗島站": "2677270","O6信義國小站": "714489","O7文化中心站": "1272679","O8五塊厝站": "681157","O9技擊館站": "736901","O10衛武營站": "715387","O11鳳山西站": "1059467","O12鳳山站": "681228","O13大東站": "653674","O14鳳山國中站": "624217","OT1大寮站": "1166751","橘線團體票": "112253","橘線其他": "40093"}
,   {"year": "103年","總計": "61308024","紅線小計": "46014176","R3小港站": "2646041","R4高雄國際機場站": "840938","R4A草衙站": "1034539","R5前鎮高中站": "1570994","R6凱旋站": "1789426","R7獅甲站": "1051483","R8三多商圈站": "4247646","R9中央公園站": "3494812","R11高雄車站": "5386062","R1+M:AJ2後驛站": "1951657","R13凹子底站": "1706889","R14巨蛋站": "4691762","R15生態園區站": "1355986","R16左營站": "5852228","R17世運站": "593977","R18油廠國小站": "981197","R19楠梓加工區站": "1479768","R20後勁站": "530734","R21都會公園站": "1151414","R22青埔站": "332824","R22A橋頭糖廠站": "358891","R23橋頭火車站": "969426","R24南岡山站": "1697630","紅線團體票": "158524","紅線其他": "139328","橘線小計": "15293848","O1西子灣站": "1553136","O2鹽埕埔站": "1376839","O4市議會站": "979614","O5R10美麗島站": "2683162","O6信義國小站": "728987","O7文化中心站": "1302332","O8五塊厝站": "721175","O9技擊館站": "779670","O10衛武營站": "716413","O11鳳山西站": "1092472","O12鳳山站": "659524","O13大東站": "674028","O14鳳山國中站": "637063","OT1大寮站": "1225953","橘線團體票": "115210","橘線其他": "48270"}
,   {"year": "104年","總計": "60203494","紅線小計": "45326519","R3小港站": "2549200","R4高雄國際機場站": "951394","R4A草衙站": "986548","R5前鎮高中站": "1519040","R6凱旋站": "1607537","R7獅甲站": "1068601","R8三多商圈站": "4409577","R9中央公園站": "3363894","R11高雄車站": "5326281","R1+M:AJ2後驛站": "1872036","R13凹子底站": "1707424","R14巨蛋站": "4757466","R15生態園區站": "1368569","R16左營站": "5976668","R17世運站": "589281","R18油廠國小站": "962710","R19楠梓加工區站": "1385444","R20後勁站": "496139","R21都會公園站": "1081189","R22青埔站": "323295","R22A橋頭糖廠站": "343396","R23橋頭火車站": "850322","R24南岡山站": "1574530","紅線團體票": "148981","紅線其他": "106997","橘線小計": "14876975","O1西子灣站": "1543105","O2鹽埕埔站": "1389773","O4市議會站": "991500","O5R10美麗島站": "2670550","O6信義國小站": "719710","O7文化中心站": "1247518","O8五塊厝站": "681770","O9技擊館站": "722454","O10衛武營站": "686221","O11鳳山西站": "1009974","O12鳳山站": "616728","O13大東站": "654358","O14鳳山國中站": "615032","OT1大寮站": "1165743","橘線團體票": "116807","橘線其他": "45732"}
,   {"year": "105年","總計": "63102604","紅線小計": "47788621","R3小港站": "2569296","R4高雄國際機場站": "1062949","R4A草衙站": "2386715","R5前鎮高中站": "1591923","R6凱旋站": "1649385","R7獅甲站": "1228729","R8三多商圈站": "4469467","R9中央公園站": "3207342","R11高雄車站": "5452611","R1+M:AJ2後驛站": "1921183","R13凹子底站": "1810160","R14巨蛋站": "4968003","R15生態園區站": "1401309","R16左營站": "6286006","R17世運站": "610089","R18油廠國小站": "980049","R19楠梓加工區站": "1354547","R20後勁站": "492231","R21都會公園站": "1083214","R22青埔站": "353017","R22A橋頭糖廠站": "304291","R23橋頭火車站": "825788","R24南岡山站": "1560500","紅線團體票": "132271","紅線其他": "87546","橘線小計": "15313983","O1西子灣站": "1586800","O2鹽埕埔站": "1517565","O4市議會站": "1014363","O5R10美麗島站": "2859895","O6信義國小站": "745305","O7文化中心站": "1304553","O8五塊厝站": "694075","O9技擊館站": "716498","O10衛武營站": "677965","O11鳳山西站": "1020422","O12鳳山站": "599909","O13大東站": "677004","O14鳳山國中站": "608502","OT1大寮站": "1149613","橘線團體票": "101471","橘線其他": "40043"}
,   {"year": "106年","總計": "63775072","紅線小計": "48395130","R3小港站": "2573802","R4高雄國際機場站": "1087384","R4A草衙站": "2376276","R5前鎮高中站": "1565309","R6凱旋站": "1729241","R7獅甲站": "1293136","R8三多商圈站": "4388765","R9中央公園站": "3139527","R11高雄車站": "5362584","R1+M:AJ2後驛站": "2003243","R13凹子底站": "1841397","R14巨蛋站": "5205631","R15生態園區站": "1415576","R16左營站": "6529428","R17世運站": "599280","R18油廠國小站": "989194","R19楠梓加工區站": "1376780","R20後勁站": "516773","R21都會公園站": "1088179","R22青埔站": "382812","R22A橋頭糖廠站": "304615","R23橋頭火車站": "837433","R24南岡山站": "1599195","紅線團體票": "112443","紅線其他": "77127","橘線小計": "15379942","O1西子灣站": "1601246","O2鹽埕埔站": "1505283","O4市議會站": "1046787","O5R10美麗島站": "2881380","O6信義國小站": "781926","O7文化中心站": "1313195","O8五塊厝站": "684789","O9技擊館站": "693867","O10衛武營站": "718857","O11鳳山西站": "982370","O12鳳山站": "581004","O13大東站": "699824","O14鳳山國中站": "603219","OT1大寮站": "1178613","橘線團體票": "75270","橘線其他": "32312"}
,   {"year": "107年","總計": "64720164","紅線小計": "48782020","R3小港站": "2596873","R4高雄國際機場站": "1231690","R4A草衙站": "2089471","R5前鎮高中站": "1560964","R6凱旋站": "1776086","R7獅甲站": "1325824","R8三多商圈站": "4326537","R9中央公園站": "3051121","R11高雄車站": "5255091","R1+M:AJ2後驛站": "2064543","R13凹子底站": "1906204","R14巨蛋站": "5204872","R15生態園區站": "1456959","R16左營站": "6808346","R17世運站": "523373","R18油廠國小站": "1033440","R19楠梓加工區站": "1430849","R20後勁站": "546439","R21都會公園站": "1132041","R22青埔站": "420257","R22A橋頭糖廠站": "311932","R23橋頭火車站": "872717","R24南岡山站": "1711653","紅線團體票": "95785","紅線其他": "48953","橘線小計": "15938144","O1西子灣站": "1625421","O2鹽埕埔站": "1471730","O4市議會站": "1157932","O5R10美麗島站": "2985726","O6信義國小站": "840635","O7文化中心站": "1336231","O8五塊厝站": "718191","O9技擊館站": "699760","O10衛武營站": "865482","O11鳳山西站": "994141","O12鳳山站": "603852","O13大東站": "716337","O14鳳山國中站": "632314","OT1大寮站": "1211096","橘線團體票": "62034","橘線其他": "17262"}
,   {"year": "108年","總計": "65393943","紅線小計": "48760695","R3小港站": "2560690","R4高雄國際機場站": "1403988","R4A草衙站": "2084561","R5前鎮高中站": "1550567","R6凱旋站": "1761549","R7獅甲站": "1350534","R8三多商圈站": "4263140","R9中央公園站": "3024863","R11高雄車站": "5051071","R1+M:AJ2後驛站": "2044539","R13凹子底站": "1891171","R14巨蛋站": "5182135","R15生態園區站": "1465165","R16左營站": "6999849","R17世運站": "526561","R18油廠國小站": "1065098","R19楠梓加工區站": "1433760","R20後勁站": "566363","R21都會公園站": "1135821","R22青埔站": "410025","R22A橋頭糖廠站": "301142","R23橋頭火車站": "854859","R24南岡山站": "1699381","紅線團體票": "87646","紅線其他": "46217","橘線小計": "16633248","O1西子灣站": "1674942","O2鹽埕埔站": "1555541","O4市議會站": "1240154","O5R10美麗島站": "3377255","O6信義國小站": "907521","O7文化中心站": "1345876","O8五塊厝站": "707268","O9技擊館站": "714976","O10衛武營站": "988132","O11鳳山西站": "927759","O12鳳山站": "600823","O13大東站": "697565","O14鳳山國中站": "627904","OT1大寮站": "1187714","橘線團體票": "63475","橘線其他": "16343"}
,   {"year": "109年","總計": "48566217","紅線小計": "36610289","R3小港站": "2144351","R4高雄國際機場站": "530039","R4A草衙站": "1485225","R5前鎮高中站": "1278303","R6凱旋站": "1291297","R7獅甲站": "1064223","R8三多商圈站": "3028924","R9中央公園站": "2241896","R11高雄車站": "3696651","R1+M:AJ2後驛站": "1556263","R13凹子底站": "1489145","R14巨蛋站": "3687740","R15生態園區站": "1150685","R16左營站": "5361030","R17世運站": "390439","R18油廠國小站": "903275","R19楠梓加工區站": "1211409","R20後勁站": "471964","R21都會公園站": "944825","R22青埔站": "354062","R22A橋頭糖廠站": "215611","R23橋頭火車站": "677758","R24南岡山站": "1359197","紅線團體票": "40214","紅線其他": "35763","橘線小計": "11955928","O1西子灣站": "1069351","O2鹽埕埔站": "986384","O4市議會站": "844341","O5R10美麗島站": "2132029","O6信義國小站": "754035","O7文化中心站": "1037542","O8五塊厝站": "553308","O9技擊館站": "567587","O10衛武營站": "739065","O11鳳山西站": "732622","O12鳳山站": "478437","O13大東站": "534249","O14鳳山國中站": "529293","OT1大寮站": "957683","橘線團體票": "27505","橘線其他": "12497"}
,   {"year": "110年","總計": "37195723","紅線小計": "28116455","R3小港站": "1692730","R4高雄國際機場站": "312215","R4A草衙站": "1024597","R5前鎮高中站": "1012364","R6凱旋站": "1036238","R7獅甲站": "814884","R8三多商圈站": "2292219","R9中央公園站": "1650697","R11高雄車站": "2576931","R1+M:AJ2後驛站": "1228250","R13凹子底站": "1338578","R14巨蛋站": "2806483","R15生態園區站": "864185","R16左營站": "4021091","R17世運站": "355894","R18油廠國小站": "720788","R19楠梓加工區站": "1036848","R20後勁站": "382142","R21都會公園站": "749002","R22青埔站": "298483","R22A橋頭糖廠站": "195609","R23橋頭火車站": "529790","R24南岡山站": "1123411","紅線團體票": "27738","紅線其他": "25288","橘線小計": "9079268","O1西子灣站": "881880","O2鹽埕埔站": "765562","O4市議會站": "617272","O5R10美麗島站": "1562777","O6信義國小站": "594465","O7文化中心站": "743685","O8五塊厝站": "444822","O9技擊館站": "422945","O10衛武營站": "562167","O11鳳山西站": "533182","O12鳳山站": "367524","O13大東站": "401356","O14鳳山國中站": "410392","OT1大寮站": "743054","橘線團體票": "18358","橘線其他": "9827"}

]
var exit_data = [
    {"year": "100年","總計": "49636631","紅線小計": "37504468","R3小港站": "2076812","R4高雄國際機場站": "611488","R4A草衙站": "885303","R5前鎮高中站": "1230016","R6凱旋站": "1431831","R7獅甲站": "920245","R8三多商圈站": "3743651","R9中央公園站": "3152817","R11高雄車站": "5150919","R1+M:AJ2後驛站": "1648983","R13凹子底站": "1435877","R14巨蛋站": "4102842","R15生態園區站": "1109186","R16左營站": "4085390","R17世運站": "483502","R18油廠國小站": "783276","R19楠梓加工區站": "1104590","R20後勁站": "421113","R21都會公園站": "925176","R22青埔站": "284858","R22A橋頭糖廠站": "326830","R23橋頭火車站": "1350504","R24南岡山站": "0","紅線團體票": "133869","紅線其他": "105390","橘線小計": "12132163","O1西子灣站": "1219086","O2鹽埕埔站": "1085720","O4市議會站": "892315","O5R10美麗島站": "2066855","O6信義國小站": "616016","O7文化中心站": "1071035","O8五塊厝站": "543182","O9技擊館站": "479291","O10衛武營站": "536151","O11鳳山西站": "890018","O12鳳山站": "648970","O13大東站": "465185","O14鳳山國中站": "500572","OT1大寮站": "983144","橘線團體票": "97552","橘線其他": "37071"}
,   {"year": "101年","總計": "56480381","紅線小計": "42566328","R3小港站": "2387417","R4高雄國際機場站": "684291","R4A草衙站": "999981","R5前鎮高中站": "1405287","R6凱旋站": "1599009","R7獅甲站": "1014962","R8三多商圈站": "4070546","R9中央公園站": "3485953","R11高雄車站": "5499603","R1+M:AJ2後驛站": "1902744","R13凹子底站": "1641483","R14巨蛋站": "4672990","R15生態園區站": "1272208","R16左營站": "4779418","R17世運站": "616822","R18油廠國小站": "875350","R19楠梓加工區站": "1339677","R20後勁站": "493020","R21都會公園站": "1059876","R22青埔站": "332257","R22A橋頭糖廠站": "386874","R23橋頭火車站": "1690517","R24南岡山站": "50022","紅線團體票": "141418","紅線其他": "164603","橘線小計": "13914053","O1西子灣站": "1417385","O2鹽埕埔站": "1243176","O4市議會站": "987466","O5R10美麗島站": "2383710","O6信義國小站": "705375","O7文化中心站": "1179843","O8五塊厝站": "629088","O9技擊館站": "530312","O10衛武營站": "623188","O11鳳山西站": "988654","O12鳳山站": "700267","O13大東站": "668511","O14鳳山國中站": "573113","OT1大寮站": "1125410","橘線團體票": "110137","橘線其他": "48418"}
,   {"year": "102年","總計": "60706303","紅線小計": "45927243","R3小港站": "2554549","R4高雄國際機場站": "731456","R4A草衙站": "1096486","R5前鎮高中站": "1489330","R6凱旋站": "1881330","R7獅甲站": "1061909","R8三多商圈站": "4267484","R9中央公園站": "3681356","R11高雄車站": "5539701","R1+M:AJ2後驛站": "2015112","R13凹子底站": "1783477","R14巨蛋站": "4882962","R15生態園區站": "1358848","R16左營站": "5358311","R17世運站": "530215","R18油廠國小站": "965496","R19楠梓加工區站": "1455703","R20後勁站": "521478","R21都會公園站": "1133260","R22青埔站": "310829","R22A橋頭糖廠站": "415801","R23橋頭火車站": "1047991","R24南岡山站": "1568035","紅線團體票": "154655","紅線其他": "121469","橘線小計": "14779060","O1西子灣站": "1575761","O2鹽埕埔站": "1405067","O4市議會站": "1016202","O5R10美麗島站": "2530712","O6信義國小站": "740987","O7文化中心站": "1219160","O8五塊厝站": "666168","O9技擊館站": "560134","O10衛武營站": "657937","O11鳳山西站": "1040585","O12鳳山站": "697597","O13大東站": "676703","O14鳳山國中站": "599702","OT1大寮站": "1234562","橘線團體票": "117690","橘線其他": "40093"}
,   {"year": "103年","總計": "61308024","紅線小計": "46228750","R3小港站": "2628993","R4高雄國際機場站": "799926","R4A草衙站": "1071079","R5前鎮高中站": "1543125","R6凱旋站": "1850127","R7獅甲站": "1093344","R8三多商圈站": "4364285","R9中央公園站": "3439461","R11高雄車站": "5463324","R1+M:AJ2後驛站": "2007853","R13凹子底站": "1773941","R14巨蛋站": "4869062","R15生態園區站": "1397402","R16左營站": "5518216","R17世運站": "548827","R18油廠國小站": "968713","R19楠梓加工區站": "1566990","R20後勁站": "516692","R21都會公園站": "1154657","R22青埔站": "325212","R22A橋頭糖廠站": "368503","R23橋頭火車站": "927448","R24南岡山站": "1737706","紅線團體票": "160787","紅線其他": "108353","橘線小計": "15079274","O1西子灣站": "1631702","O2鹽埕埔站": "1447241","O4市議會站": "991038","O5R10美麗島站": "2514949","O6信義國小站": "751618","O7文化中心站": "1261772","O8五塊厝站": "707710","O9技擊館站": "554368","O10衛武營站": "655454","O11鳳山西站": "1011394","O12鳳山站": "677944","O13大東站": "644962","O14鳳山國中站": "557267","OT1大寮站": "1240744","橘線團體票": "123019","橘線其他": "32116"}
,   {"year": "104年","總計": "60203494","紅線小計": "45461132","R3小港站": "2543004","R4高雄國際機場站": "888240","R4A草衙站": "1026967","R5前鎮高中站": "1486761","R6凱旋站": "1648446","R7獅甲站": "1113164","R8三多商圈站": "4511716","R9中央公園站": "3310852","R11高雄車站": "5342749","R1+M:AJ2後驛站": "1920176","R13凹子底站": "1786851","R14巨蛋站": "4924561","R15生態園區站": "1419718","R16左營站": "5643636","R17世運站": "551770","R18油廠國小站": "953874","R19楠梓加工區站": "1465414","R20後勁站": "483047","R21都會公園站": "1088223","R22青埔站": "319559","R22A橋頭糖廠站": "350811","R23橋頭火車站": "814594","R24南岡山站": "1614619","紅線團體票": "145383","紅線其他": "106997","橘線小計": "14742362","O1西子灣站": "1570827","O2鹽埕埔站": "1489753","O4市議會站": "1017838","O5R10美麗島站": "2585402","O6信義國小站": "748929","O7文化中心站": "1208870","O8五塊厝站": "662252","O9技擊館站": "565653","O10衛武營站": "630113","O11鳳山西站": "962789","O12鳳山站": "630984","O13大東站": "691236","O14鳳山國中站": "584685","OT1大寮站": "1226894","橘線團體票": "120405","橘線其他": "45732"}
,   {"year": "105年","總計": "63102604","紅線小計": "47913365","R3小港站": "2566209","R4高雄國際機場站": "978373","R4A草衙站": "2431334","R5前鎮高中站": "1552303","R6凱旋站": "1712210","R7獅甲站": "1286830","R8三多商圈站": "4572227","R9中央公園站": "3150925","R11高雄車站": "5466854","R1+M:AJ2後驛站": "1970742","R13凹子底站": "1892628","R14巨蛋站": "5123731","R15生態園區站": "1462207","R16左營站": "5950956","R17世運站": "550971","R18油廠國小站": "971907","R19楠梓加工區站": "1427381","R20後勁站": "477625","R21都會公園站": "1099665","R22青埔站": "355827","R22A橋頭糖廠站": "314186","R23橋頭火車站": "785233","R24南岡山站": "1598457","紅線團體票": "127038","紅線其他": "87546","橘線小計": "15189239","O1西子灣站": "1594777","O2鹽埕埔站": "1633172","O4市議會站": "1033888","O5R10美麗島站": "2777630","O6信義國小站": "781484","O7文化中心站": "1259829","O8五塊厝站": "679767","O9技擊館站": "572476","O10衛武營站": "625736","O11鳳山西站": "969593","O12鳳山站": "612576","O13大東站": "711580","O14鳳山國中站": "575680","OT1大寮站": "1214304","橘線團體票": "106704","橘線其他": "40043"}
,   {"year": "106年","總計": "63775072","紅線小計": "48501185","R3小港站": "2573470","R4高雄國際機場站": "1000111","R4A草衙站": "2406064","R5前鎮高中站": "1528157","R6凱旋站": "1786565","R7獅甲站": "1351210","R8三多商圈站": "4496093","R9中央公園站": "3074881","R11高雄車站": "5409782","R1+M:AJ2後驛站": "2041609","R13凹子底站": "1925592","R14巨蛋站": "5366932","R15生態園區站": "1484725","R16左營站": "6138206","R17世運站": "563401","R18油廠國小站": "985700","R19楠梓加工區站": "1447223","R20後勁站": "500053","R21都會公園站": "1107021","R22青埔站": "388693","R22A橋頭糖廠站": "314161","R23橋頭火車站": "793330","R24南岡山站": "1632739","紅線團體票": "108340","紅線其他": "77127","橘線小計": "15273887","O1西子灣站": "1608429","O2鹽埕埔站": "1610881","O4市議會站": "1063778","O5R10美麗島站": "2805453","O6信義國小站": "816913","O7文化中心站": "1260675","O8五塊厝站": "671764","O9技擊館站": "570252","O10衛武營站": "668924","O11鳳山西站": "931920","O12鳳山站": "597849","O13大東站": "731664","O14鳳山國中站": "572230","OT1大寮站": "1251470","橘線團體票": "79373","橘線其他": "32312"}
,   {"year": "107年","總計": "64720164","紅線小計": "48804471","R3小港站": "2588905","R4高雄國際機場站": "1120827","R4A草衙站": "2125271","R5前鎮高中站": "1523246","R6凱旋站": "1788108","R7獅甲站": "1384045","R8三多商圈站": "4460015","R9中央公園站": "2975979","R11高雄車站": "5264562","R1+M:AJ2後驛站": "2118139","R13凹子底站": "2010245","R14巨蛋站": "5386416","R15生態園區站": "1523696","R16左營站": "6426299","R17世運站": "457872","R18油廠國小站": "1022776","R19楠梓加工區站": "1501544","R20後勁站": "526104","R21都會公園站": "1141551","R22青埔站": "427300","R22A橋頭糖廠站": "321259","R23橋頭火車站": "824960","R24南岡山站": "1744116","紅線團體票": "92283","紅線其他": "48953","橘線小計": "15915693","O1西子灣站": "1634258","O2鹽埕埔站": "1630862","O4市議會站": "1177874","O5R10美麗島站": "2914251","O6信義國小站": "880851","O7文化中心站": "1292548","O8五塊厝站": "706984","O9技擊館站": "581972","O10衛武營站": "808721","O11鳳山西站": "959584","O12鳳山站": "617161","O13大東站": "746653","O14鳳山國中站": "595768","OT1大寮站": "1285408","橘線團體票": "65536","橘線其他": "17262"}
,   {"year": "108年","總計": "65393943","紅線小計": "48767645","R3小港站": "2569937","R4高雄國際機場站": "1263618","R4A草衙站": "2124269","R5前鎮高中站": "1510410","R6凱旋站": "1766636","R7獅甲站": "1413917","R8三多商圈站": "4397677","R9中央公園站": "2969374","R11高雄車站": "5018604","R1+M:AJ2後驛站": "2099421","R13凹子底站": "2019602","R14巨蛋站": "5356671","R15生態園區站": "1525778","R16左營站": "6628650","R17世運站": "478099","R18油廠國小站": "1047339","R19楠梓加工區站": "1505626","R20後勁站": "541257","R21都會公園站": "1141401","R22青埔站": "417968","R22A橋頭糖廠站": "306998","R23橋頭火車站": "804284","R24南岡山站": "1724257","紅線團體票": "89635","紅線其他": "46217","橘線小計": "16626298","O1西子灣站": "1697531","O2鹽埕埔站": "1703449","O4市議會站": "1258112","O5R10美麗島站": "3312013","O6信義國小站": "943609","O7文化中心站": "1319819","O8五塊厝站": "704110","O9技擊館站": "595179","O10衛武營站": "925417","O11鳳山西站": "908728","O12鳳山站": "616614","O13大東站": "726660","O14鳳山國中站": "588120","OT1大寮站": "1249108","橘線團體票": "61486","橘線其他": "16343"}
,   {"year": "109年","總計": "48566217","紅線小計": "36664190","R3小港站": "2151841","R4高雄國際機場站": "510141","R4A草衙站": "1524132","R5前鎮高中站": "1243133","R6凱旋站": "1305903","R7獅甲站": "1121097","R8三多商圈站": "3119436","R9中央公園站": "2210455","R11高雄車站": "3629871","R1+M:AJ2後驛站": "1591845","R13凹子底站": "1580528","R14巨蛋站": "3839085","R15生態園區站": "1209985","R16左營站": "5063366","R17世運站": "338465","R18油廠國小站": "882604","R19楠梓加工區站": "1267702","R20後勁站": "448327","R21都會公園站": "948961","R22青埔站": "357109","R22A橋頭糖廠站": "219812","R23橋頭火車站": "641790","R24南岡山站": "1383075","紅線團體票": "39764","紅線其他": "35763","橘線小計": "11902027","O1西子灣站": "1089809","O2鹽埕埔站": "1070463","O4市議會站": "880794","O5R10美麗島站": "2075044","O6信義國小站": "781376","O7文化中心站": "991887","O8五塊厝站": "551126","O9技擊館站": "477151","O10衛武營站": "681956","O11鳳山西站": "716362","O12鳳山站": "489660","O13大東站": "552589","O14鳳山國中站": "495985","OT1大寮站": "1007373","橘線團體票": "27955","橘線其他": "12497"}
,   {"year": "110年","總計": "37195723","紅線小計": "28165911","R3小港站": "1701554","R4高雄國際機場站": "309400","R4A草衙站": "1046838","R5前鎮高中站": "986850","R6凱旋站": "1056864","R7獅甲站": "851391","R8三多商圈站": "2359047","R9中央公園站": "1604242","R11高雄車站": "2531794","R1+M:AJ2後驛站": "1250864","R13凹子底站": "1421112","R14巨蛋站": "2915330","R15生態園區站": "900557","R16左營站": "3804255","R17世運站": "327178","R18油廠國小站": "705894","R19楠梓加工區站": "1075942","R20後勁站": "360771","R21都會公園站": "759113","R22青埔站": "299751","R22A橋頭糖廠站": "199271","R23橋頭火車站": "503603","R24南岡山站": "1140993","紅線團體票": "28009","紅線其他": "25288","橘線小計": "9029812","O1西子灣站": "909160","O2鹽埕埔站": "813416","O4市議會站": "645457","O5R10美麗島站": "1508149","O6信義國小站": "612277","O7文化中心站": "720927","O8五塊厝站": "447699","O9技擊館站": "357024","O10衛武營站": "521988","O11鳳山西站": "515977","O12鳳山站": "372546","O13大東站": "415370","O14鳳山國中站": "386895","OT1大寮站": "775013","橘線團體票": "18087","橘線其他": "9827"}  

]

var stations = ['R3小港站', 'R4高雄國際機場站', 'R4A草衙站', 'R5前鎮高中站', 'R6凱旋站', 'R7獅甲站', 'R8三多商圈站', 'R9中央公園站', 'R11高雄車站', 'R1+M:AJ2後驛站', 'R13凹子底站', 'R14巨蛋站', 'R15生態園區站', 'R16左營站', 'R17世運站', 'R18油廠國小站', 'R19楠梓加工區站', 'R20後勁站', 'R21都會公園站', 'R22青埔站', 'R22A橋頭糖廠站', 'R23橋頭火車站', 'R24南岡山站', 'O1西子灣站', 'O2鹽埕埔站', 'O4市議會站', 'O5R10美麗島站', 'O6信義國小站', 'O7文化中心站', 'O8五塊厝站', 'O9技擊館站', 'O10衛武營站', 'O11鳳山西站', 'O12鳳山站', 'O13大東站', 'O14鳳山國中站', 'OT1大寮站'];
var areas =["鼓山區", "左營區", "楠梓區", "橋頭區", "岡山區", "小港區", "前鎮區", "前金區", "新興區", "苓雅區", "鳳山區", "大寮區"];
var stations_by_area = {
    "鼓山區": ["R13凹子底站", "O1西子灣站"],
    "左營區": ["R15生態園區站", "R16左營站"],
    "楠梓區": ["R17世運站", "R18油廠國小站", "R19楠梓加工區站", "R20後勁站", "R21都會公園站"],
    "橋頭區": ["R22青埔站", "R22A橋頭糖廠站", "R23橋頭火車站"],
    "岡山區": ["R24南岡山站"],
    "小港區": ["R3小港站"],
    "前鎮區": ["R4高雄國際機場站", "R4A草衙站", "R5前鎮高中站", "R6凱旋站", "R7獅甲站", "R8三多商圈站"],
    "前金區": ["R9中央公園站", "O4市議會站"],
    "新興區": ["O5R10美麗島站", "O6信義國小站"],
    "苓雅區": ["O7文化中心站", "O8五塊厝站", "O9技擊館站", "O10衛武營站"],
    "鳳山區": ["O11鳳山西站", "O12鳳山站", "O13大東站", "O14鳳山國中站"],
    "大寮區": ["OT1大寮站"]

}
//line chart function

function entry_lineChart(){
    const ctx = document.getElementById('entry_data_canvas');
    const entry_datasets = [];
    var data_by_year = [];
    
    for (var i=0;i<37;i++){
        var data_by_year = [];
        for (var j=0;j<11;j++){
            data_by_year.push(entry_data[j][stations[i]])
        }
        
        entry_datasets.push({label:stations[i],
            data:data_by_year,
            borderWidth: 1,
            fill: false,
            tension: 0.1,
            hidden: true
            }
        )
    }

    new Chart(ctx,{
        type:'line',
        data:{
        labels: ['100年','101年','102年','103年','104年', '105年', '106年', '107年', '108年', '109年','110年'],
        datasets:entry_datasets
        }}
    );

    
}

function exit_lineChart(){
    const ctx = document.getElementById('exit_data_canvas');
    const exit_datasets = [];
    var data_by_year = [];
    
    for (var i=0;i<37;i++){
        var data_by_year = [];
        for (var j=0;j<11;j++){
            data_by_year.push(exit_data[j][stations[i]])
        }
        
        exit_datasets.push({label:stations[i],
            data:data_by_year,
            borderWidth: 1,
            fill: false,
            tension: 0.1,
            hidden: true
            }
        )
    }

    new Chart(ctx,{
        type:'line',
        data:{
        labels: ['100年','101年','102年','103年','104年', '105年', '106年', '107年', '108年', '109年','110年'],
        datasets:exit_datasets
        }}
    );

    
}

//bar chart function 

function entry_barChart(year){
        switch (year){
            case 100:
                var canvas = 'entry_bar_canvas_100';
                var chart_label = '高雄100年捷運入站人數';
                break;
            case 101:
                var canvas = 'entry_bar_canvas_101';
                var chart_label = '高雄101年捷運入站人數';
                break;
            case 102:
                var canvas = 'entry_bar_canvas_102';
                var chart_label = '高雄102年捷運入站人數';
                break;
            case 103:
                var canvas = 'entry_bar_canvas_103';
                var chart_label = '高雄103年捷運入站人數';
                break;
            case 104:
                var canvas = 'entry_bar_canvas_104';
                var chart_label = '高雄104年捷運入站人數';
                break;
            case 105:
                var canvas = 'entry_bar_canvas_105';
                var chart_label = '高雄105年捷運入站人數';
                break;
            case 106:
                var canvas = 'entry_bar_canvas_106';
                var chart_label = '高雄106年捷運入站人數';
                break;
            case 107:
                var canvas = 'entry_bar_canvas_107';
                var chart_label = '高雄107年捷運入站人數';
                break;
            case 108:
                var canvas = 'entry_bar_canvas_108';
                var chart_label = '高雄108年捷運入站人數';
                break;
            case 109:
                var canvas = 'entry_bar_canvas_109';
                var chart_label = '高雄109年捷運入站人數';
                break;
            case 110:
                var canvas = 'entry_bar_canvas_110';
                var chart_label = '高雄110年捷運入站人數';
                break;
        }
        const ctx = document.getElementById(canvas);
        const area_name =[];
        var datasets1 = Array(12).fill(0);
        var datasets2 = Array(12).fill(0);
        var datasets3 = Array(12).fill(0);
        var datasets4 = Array(12).fill(0);
        var datasets5 = Array(12).fill(0);
        var datasets6 = Array(12).fill(0);
        for(var i=0;i<12;i++){
            area_name.push(areas[i]);
            var station_count = stations_by_area[areas[i]].length;
            for(var j=0;j<station_count;j++){   
                switch(station_count){
                    case 1:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                    case 2:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets2[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                    case 3:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets2[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets3[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                    case 4:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets2[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets3[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets4[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                    case 5:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets2[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets3[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets4[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets5[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                    case 6:
                        datasets1[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets2[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets3[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets4[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets5[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        datasets6[i] += parseInt(entry_data[year-100][stations_by_area[areas[i]][j]]);
                        break;
                }
            }
        }
        new Chart(ctx, {
            type: 'bar',
            data: {
                labels: area_name,
                datasets: [{
                    backgroundColor: "#F05D5E",
                    data: datasets1,

                },{
                    backgroundColor: "#caf270",
                    data: datasets2,
                }, {
                    backgroundColor: "#45c490",
                    data: datasets3,
                }, {
                    backgroundColor: "#008d93",
                    data: datasets4,
                }, {
                    backgroundColor: "#2e5468",
                    data: datasets5,
                },{
                    backgroundColor: "#493657",
                    data: datasets6,
                }
            ]
            },
            options:{
                plugins: {
                    title:{
                        display:true,
                        padding:10,
                        text:chart_label,
                        
    
                    },
                    legend: {
                        display: false // Hide legend labels
                    }
                },
                scales:{
                    x:{
                        stacked:true,

                    },
                    y:{
                        stacked:true,
                        
                    }
                }
            },
            borderWidth: 1
        });
    
} 

function exit_barChart(year){
    switch (year){
        case 100:
            var canvas = 'exit_bar_canvas_100';
            var chart_label = '高雄100年捷運出站人數';
            break;
        case 101:
            var canvas = 'exit_bar_canvas_101';
            var chart_label = '高雄101年捷運出站人數';
            break;
        case 102:
            var canvas = 'exit_bar_canvas_102';
            var chart_label = '高雄102年捷運出站人數';
            break;
        case 103:
            var canvas = 'exit_bar_canvas_103';
            var chart_label = '高雄103年捷運出站人數';
            break;
        case 104:
            var canvas = 'exit_bar_canvas_104';
            var chart_label = '高雄104年捷運出站人數';
            break;
        case 105:
            var canvas = 'exit_bar_canvas_105';
            var chart_label = '高雄105年捷運出站人數';
            break;
        case 106:
            var canvas = 'exit_bar_canvas_106';
            var chart_label = '高雄106年捷運出站人數';
            break;
        case 107:
            var canvas = 'exit_bar_canvas_107';
            var chart_label = '高雄107年捷運出站人數';
            break;
        case 108:
            var canvas = 'exit_bar_canvas_108';
            var chart_label = '高雄108年捷運出站人數';
            break;
        case 109:
            var canvas = 'exit_bar_canvas_109';
            var chart_label = '高雄109年捷運出站人數';
            break;
        case 110:
            var canvas = 'exit_bar_canvas_110';
            var chart_label = '高雄110年捷運出站人數';
            break;
    }
    const ctx = document.getElementById(canvas);
    const area_name =[];
    var datasets1 = Array(12).fill(0);
    var datasets2 = Array(12).fill(0);
    var datasets3 = Array(12).fill(0);
    var datasets4 = Array(12).fill(0);
    var datasets5 = Array(12).fill(0);
    var datasets6 = Array(12).fill(0);
    for(var i=0;i<12;i++){
        area_name.push(areas[i]);
        var station_count = stations_by_area[areas[i]].length;
        for(var j=0;j<station_count;j++){   
            switch(station_count){
                case 1:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
                case 2:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets2[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
                case 3:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets2[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets3[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
                case 4:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets2[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets3[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets4[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
                case 5:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets2[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets3[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets4[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets5[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
                case 6:
                    datasets1[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets2[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets3[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets4[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets5[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    datasets6[i] += parseInt(exit_data[year-100][stations_by_area[areas[i]][j]]);
                    break;
            }
        }
    }


    new Chart(ctx, {
        type: 'bar',
        data: {
            labels: area_name,
            datasets: [{
                backgroundColor: "#f05d5e",
                data: datasets1,
            },{
                backgroundColor: "#caf270",
                data: datasets2,
            }, {
                backgroundColor: "#45c490",
                data: datasets3,
            }, {
                backgroundColor: "#008d93",
                data: datasets4,
            }, {
                backgroundColor: "#2e5468",
                data: datasets5,
            },{
                backgroundColor: "#493657",
                data: datasets6,
            }
        ]
        },
        options:{
            plugins: {
                title:{
                    display:true,
                    padding:10,
                    text:chart_label

                },
                legend: {
                    display: false // Hide legend labels
                }
            },
            scales:{
                x:{
                    stacked:true,
                },
                y:{
                    stacked:true
                }
            }
        },
        borderWidth: 1
    });

}


