var area_data = [
    {"field1":"鹽埕區","104年":"25032","105年":"24659","106年":"24219","107年":"24059","108年":"23889","109年":"23553","110年":"22912","111年":"22481","112年":"22529"}
    ,
    {"field1":"鼓山區","104年":"136665","105年":"138099","106年":"139259","107年":"140133","108年":"141055","109年":"141488","110年":"140410","111年":"139590","112年":"140040"}
    ,
    {"field1":"左營區","104年":"196244","105年":"196936","106年":"197072","107年":"196872","108年":"197728","109年":"197306","110年":"196314","111年":"195296","112年":"196620"}
    ,
    {"field1":"楠梓區","104年":"179931","105年":"181845","106年":"183751","107年":"185687","108年":"187999","109年":"189426","110年":"190149","111年":"191313","112年":"191929"}
    ,
    {"field1":"三民區","104年":"346169","105年":"344888","106年":"343243","107年":"340913","108年":"339269","109年":"336868","110年":"333038","111年":"330419","112年":"331389"}
    ,
    {"field1":"新興區","104年":"51955","105年":"51431","106年":"51153","107年":"51032","108年":"51014","109年":"50490","110年":"49383","111年":"49068","112年":"49422"}
    ,
    {"field1":"前金區","104年":"27388","105年":"27151","106年":"26991","107年":"26831","108年":"26879","109年":"26668","110年":"26416","111年":"26633","112年":"26897"}
    ,
    {"field1":"苓雅區","104年":"174515","105年":"172895","106年":"171033","107年":"169648","108年":"168825","109年":"167280","110年":"164572","111年":"162642","112年":"163452"}
    ,
    {"field1":"前鎮區","104年":"192593","105年":"191262","106年":"189839","107年":"188340","108年":"187524","109年":"185828","110年":"182805","111年":"180282","112年":"180510"}
    ,
    {"field1":"旗津區","104年":"29008","105年":"28898","106年":"28763","107年":"28506","108年":"28129","109年":"27785","110年":"27204","111年":"26671","112年":"26491"}
    ,
    {"field1":"小港區","104年":"156256","105年":"157023","106年":"157475","107年":"157742","108年":"157793","109年":"157356","110年":"156035","111年":"154808","112年":"154878"}
    ,
    {"field1":"鳳山區","104年":"356320","105年":"357768","106年":"359120","107年":"359519","108年":"359882","109年":"359576","110年":"357946","111年":"356016","112年":"356712"}
    ,
    {"field1":"林園區","104年":"70401","105年":"70201","106年":"69990","107年":"69870","108年":"69604","109年":"69478","110年":"68893","111年":"68429","112年":"68371"}
    ,
    {"field1":"大寮區","104年":"111663","105年":"112258","106年":"112397","107年":"112421","108年":"112259","109年":"112265","110年":"111933","111年":"111514","112年":"111663"}
    ,
    {"field1":"大樹區","104年":"43161","105年":"43067","106年":"42757","107年":"42390","108年":"42142","109年":"41764","110年":"41257","111年":"40732","112年":"40658"}
    ,
    {"field1":"大社區","104年":"34566","105年":"34615","106年":"34577","107年":"34604","108年":"34410","109年":"34324","110年":"34050","111年":"33670","112年":"33655"}
    ,
    {"field1":"仁武區","104年":"82614","105年":"84122","106年":"85894","107年":"87694","108年":"89595","109年":"91893","110年":"93581","111年":"95089","112年":"95934"}
    ,
    {"field1":"鳥松區","104年":"43965","105年":"44265","106年":"44291","107年":"44469","108年":"44960","109年":"44938","110年":"44393","111年":"44168","112年":"44342"}
    ,
    {"field1":"岡山區","104年":"97827","105年":"97643","106年":"97329","107年":"97103","108年":"97127","109年":"96841","110年":"95922","111年":"95349","112年":"95630"}
    ,
    {"field1":"橋頭區","104年":"37317","105年":"37448","106年":"37579","107年":"37650","108年":"38254","109年":"38955","110年":"40094","111年":"40470","112年":"40878"}
    ,
    {"field1":"燕巢區","104年":"30124","105年":"29960","106年":"29922","107年":"29820","108年":"29686","109年":"29493","110年":"29244","111年":"28963","112年":"28858"}
    ,
    {"field1":"田寮區","104年":"7473","105年":"7340","106年":"7245","107年":"7159","108年":"7043","109年":"6919","110年":"6788","111年":"6655","112年":"6613"}
    ,
    {"field1":"阿蓮區","104年":"29319","105年":"29093","106年":"28844","107年":"28658","108年":"28489","109年":"28331","110年":"28011","111年":"27656","112年":"27618"}
    ,
    {"field1":"路竹區","104年":"53033","105年":"53007","106年":"52761","107年":"52538","108年":"52185","109年":"51726","110年":"51217","111年":"50602","112年":"50669"}
    ,
    {"field1":"湖內區","104年":"29615","105年":"29876","106年":"29803","107年":"29794","108年":"29684","109年":"29882","110年":"29648","111年":"29540","112年":"29625"}
    ,
    {"field1":"茄萣區","104年":"30551","105年":"30412","106年":"30217","107年":"30089","108年":"30006","109年":"29960","110年":"29812","111年":"29480","112年":"29414"}
    ,
    {"field1":"永安區","104年":"14152","105年":"14039","106年":"13980","107年":"13909","108年":"13786","109年":"13705","110年":"13618","111年":"13776","112年":"13761"}
    ,
    {"field1":"彌陀區","104年":"19655","105年":"19555","106年":"19383","107年":"19252","108年":"19049","109年":"18872","110年":"18627","111年":"18468","112年":"18444"}
    ,
    {"field1":"梓官區","104年":"36429","105年":"36252","106年":"36116","107年":"35940","108年":"35750","109年":"35517","110年":"35117","111年":"34845","112年":"34832"}
    ,
    {"field1":"旗山區","104年":"37770","105年":"37342","106年":"36940","107年":"36652","108年":"36313","109年":"35764","110年":"35162","111年":"34622","112年":"34560"}
    ,
    {"field1":"美濃區","104年":"40810","105年":"40399","106年":"39973","107年":"39589","108年":"39074","109年":"38611","110年":"37949","111年":"37317","112年":"37273"}
    ,
    {"field1":"六龜區","104年":"13467","105年":"13217","106年":"13016","107年":"12939","108年":"12633","109年":"12391","110年":"12135","111年":"11920","112年":"11846"}
    ,
    {"field1":"甲仙區","104年":"6291","105年":"6214","106年":"6107","107年":"6026","108年":"5943","109年":"5877","110年":"5788","111年":"5661","112年":"5624"}
    ,
    {"field1":"杉林區","104年":"12383","105年":"12201","106年":"12038","107年":"11795","108年":"11681","109年":"11541","110年":"11288","111年":"11094","112年":"11031"}
    ,
    {"field1":"內門區","104年":"14978","105年":"14743","106年":"14540","107年":"14437","108年":"14195","109年":"13976","110年":"13770","111年":"13499","112年":"13389"}
    ,
    {"field1":"茂林區","104年":"1890","105年":"1896","106年":"1924","107年":"1994","108年":"1937","109年":"1915","110年":"1874","111年":"1940","112年":"1913"}
    ,
    {"field1":"桃源區","104年":"4239","105年":"4220","106年":"4246","107年":"4311","108年":"4261","109年":"4223","110年":"4193","111年":"4258","112年":"4260"}
    ,
    {"field1":"那瑪夏區","104年":"3149","105年":"3131","106年":"3125","107年":"3148","108年":"3146","109年":"3147","110年":"3143","111年":"3201","112年":"3163"}
    ,
    {"field1":"總數","104年":"2778918","105年":"2779371","106年":"2776912","107年":"2773533","108年":"2773198","109年":"2765932","110年":"2744691","111年":"2728137","112年":"2734893"}
    
    ]
    function Calculate_the_slope(){
        for(var i = 0 ; i < 39 ; i++){
            y1 = parseFloat(area_data[i]["104年"]);
            y2 = parseFloat(area_data[i]["108年"]);
            y1 = y1 / 1000;
            y2 = y2 / 1000;
            x1 = parseFloat(104);
            x2 = parseFloat(108);
            num = (y2 - y1) / (x2 - x1);
            console.log(area_data[i]["field1"] + num.toFixed(3));
        }
    }
    function area_line_demo(){
        const ctx = document.getElementById('area_data_canvas');
        const area_datasets = []
        for(var i = 0 ; i < 39 ; i++){
            area_datasets.push({label:area_data[i].field1 , 
            data: [area_data[i]["104年"], area_data[i]["105年"], area_data[i]["106年"], area_data[i]["107年"], area_data[i]["108年"], 
            area_data[i]["109年"],area_data[i]["110年"],area_data[i]["111年"],area_data[i]["112年"]],borderWidth: 1,fill: false,tension: 0.1,hidden: true})
        }
        new Chart(ctx, {
        type: 'line',
        data: {
        labels: ['104年', '105年', '106年', '107年', '108年', '109年','110年','111年','112年'],
        datasets:area_datasets,
        
        
        }});
    }

    function area_bar_demo_104年(){
    var ctx2 = document.getElementById("area_data_canvas_104年");
    const area_name = [];
    const area_data_104 = [];
    for(var i = 0 ; i < 38 ; i++){
        area_name.push(area_data[i]["field1"]);
        area_data_104.push(area_data[i]["104年"]);
    }
    new Chart(ctx2, {
        type: 'bar',
        data: {
            labels: area_name,
            datasets: [{
                label: '高雄104年各區人口',
                data: area_data_104,
            }]
        },
        borderWidth: 1
    });
    }

    function area_bar_demo_105年(){
        var ctx2 = document.getElementById("area_data_canvas_105年");
        const area_name = [];
        const area_data_105 = [];
        for(var i = 0 ; i < 38 ; i++){
            area_name.push(area_data[i]["field1"]);
            area_data_105.push(area_data[i]["105年"]);
        }
        new Chart(ctx2, {
            type: 'bar',
            data: {
                labels: area_name,
                datasets: [{
                    label: '高雄105年各區人口',
                    data: area_data_105,
                }]
            },
            borderWidth: 1
        });
    }

        function area_bar_demo_106年(){
            var ctx2 = document.getElementById("area_data_canvas_106年");
            const area_name = [];
            const area_data_106 = [];
            for(var i = 0 ; i < 38 ; i++){
                area_name.push(area_data[i]["field1"]);
                area_data_106.push(area_data[i]["106年"]);
            }
            new Chart(ctx2, {
                type: 'bar',
                data: {
                    labels: area_name,
                    datasets: [{
                        label: '高雄106年各區人口',
                        data: area_data_106,
                    }]
                },
                borderWidth: 1
            });
            }

            function area_bar_demo_107年(){
                var ctx2 = document.getElementById("area_data_canvas_107年");
                const area_name = [];
                const area_data_10 = [];
                for(var i = 0 ; i < 38 ; i++){
                    area_name.push(area_data[i]["field1"]);
                    area_data_10.push(area_data[i]["107年"]);
                }
                new Chart(ctx2, {
                    type: 'bar',
                    data: {
                        labels: area_name,
                        datasets: [{
                            label: '高雄107年各區人口',
                            data: area_data_10,
                        }]
                    },
                    borderWidth: 1
                });
                }

                function area_bar_demo_108年(){
                    var ctx2 = document.getElementById("area_data_canvas_108年");
                    const area_name = [];
                    const area_data_10 = [];
                    for(var i = 0 ; i < 38 ; i++){
                        area_name.push(area_data[i]["field1"]);
                        area_data_10.push(area_data[i]["108年"]);
                    }
                    new Chart(ctx2, {
                        type: 'bar',
                        data: {
                            labels: area_name,
                            datasets: [{
                                label: '高雄108年各區人口',
                                data: area_data_10,
                            }]
                        },
                        borderWidth: 1
                    });
                    }

                    function area_bar_demo_109年(){
                        var ctx2 = document.getElementById("area_data_canvas_109年");
                        const area_name = [];
                        const area_data_10 = [];
                        for(var i = 0 ; i < 38 ; i++){
                            area_name.push(area_data[i]["field1"]);
                            area_data_10.push(area_data[i]["109年"]);
                        }
                        new Chart(ctx2, {
                            type: 'bar',
                            data: {
                                labels: area_name,
                                datasets: [{
                                    label: '高雄109年各區人口',
                                    data: area_data_10,
                                }]
                            },
                            borderWidth: 1
                        });
                        }

                    function area_bar_demo_110年(){
                        var ctx2 = document.getElementById("area_data_canvas_110年");
                        const area_name = [];
                        const area_data_10 = [];
                        for(var i = 0 ; i < 38 ; i++){
                            area_name.push(area_data[i]["field1"]);
                            area_data_10.push(area_data[i]["110年"]);
                        }
                        new Chart(ctx2, {
                            type: 'bar',
                            data: {
                                labels: area_name,
                                datasets: [{
                                    label: '高雄110年各區人口',
                                    data: area_data_10,
                                }]
                            },
                            borderWidth: 1
                        });
                        }

                        function area_bar_demo_111年(){
                            var ctx2 = document.getElementById("area_data_canvas_111年");
                            const area_name = [];
                            const area_data_10 = [];
                            for(var i = 0 ; i < 38 ; i++){
                                area_name.push(area_data[i]["field1"]);
                                area_data_10.push(area_data[i]["111年"]);
                            }
                            new Chart(ctx2, {
                                type: 'bar',
                                data: {
                                    labels: area_name,
                                    datasets: [{
                                        label: '高雄111年各區人口',
                                        data: area_data_10,
                                    }]
                                },
                                borderWidth: 1
                            });
                            }

                            function area_bar_demo_112年(){
                                var ctx2 = document.getElementById("area_data_canvas_112年");
                                const area_name = [];
                                const area_data_10 = [];
                                for(var i = 0 ; i < 38 ; i++){
                                    area_name.push(area_data[i]["field1"]);
                                    area_data_10.push(area_data[i]["112年"]);
                                }
                                new Chart(ctx2, {
                                    type: 'bar',
                                    data: {
                                        labels: area_name,
                                        datasets: [{
                                            label: '高雄112年各區人口',
                                            data: area_data_10,
                                        }]
                                    },
                                    borderWidth: 1
                                });
                                }
                            var vm = new Vue({
                                el: "#app",
                                data:{
                                    filter:"",
                                    plase_data: area_data
                                },computed:{
                                    now_area: function(){
                                    var vobj = this;
                                    var result = area_data.filter(function(obj){
                                    return obj.field1 == vobj.filter;
                                    })    
                                    if (result.length == 0){
                                    return null;
                                    }
                                    return result[0];
                                    }
                                }
                                })
                                $(document).ready(function(){
                                    $("path").mouseenter(function(e){
                                        var field1_data = $(this).attr("data-name")
                                        vm.filter = field1_data;
                                })
                                });

                            
                            
                            

        